import numpy
#массивы numpy позволяют быстро работать со списками с элементами одинакового типа
a = numpy.array([1,7,3,5,0,2,11,-11])
print(f"Массив a {a}")
b = numpy.array([[2,6,1,10],[7,1,8,55]])
print(f"Массив b {b}")
#Возможно вывести измерение, форму, размер (длину) сумму массива
print(f"Кол-во измерений массива a {a.ndim} Форма массива {a.shape} Размер {a.size}")
print(f"Максимум {a.max()} Минимум {a.min()} Сумма эл-тов {a.sum()} Сред.Ариф {numpy.average(a)}")
print(f"Кол-во измерений массива b {b.ndim} Форма массива {b.shape} Размер {b.size}")
print(f"Максимум {b.max()} Минимум {b.min()} Сумма эл-тов {b.sum()} Сред.Ариф {numpy.average(b)}")
print("Сложение массивов")
print(a.reshape(2,4) + b)

